{"topicDetails": [{"topicTitle": ["Topic 1", "Topic One", "Circulatory System"], "contextText": "Organs: Heart, blood vessels (arteries, veins, capillaries), blood .Function: Transports oxygen, nutrients, hormones, and waste products throughout the body.Detail: The circulatory system is responsible for transporting blood, nutrients, oxygen, carbon dioxide, and hormones throughout the body. It consists of the heart, blood, and a network of blood vessels (arteries, veins, and capillaries). The heart, a muscular organ, pumps blood through these vessels in a closed-loop system, ensuring that oxygenated blood reaches the body’s tissues and organs while removing waste products like carbon dioxide. Blood vessels are classified into arteries (which carry blood away from the heart), veins (which bring blood back to the heart), and capillaries (tiny vessels where the exchange of oxygen, nutrients, and waste occurs). This system plays a vital role in maintaining body temperature, pH balance, and overall homeostasis. The circulatory system also supports the immune system by transporting white blood cells to areas of infection or injury.", "videoLink": "https://www.youtube.com/watch?v=f9ONXd_-anM", "imageLink": "https://www.thoughtco.com/thmb/KHjPoXpHSOEayCpFLk0BKLC6Wvs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/GettyImages-97537745-59efa47d6f53ba0011c0070b.jpg", "referenceLink": "https://en.wikipedia.org/wiki/Circulatory_system", "keywords": "Topic One,Topic 1,Circulatory "}, {"topicTitle": ["Topic 2", "Topic Two", "Respiratory System"], "contextText": "Organs: Lungs, trachea, bronchi, diaphragm .Function:Provides oxygen to the blood and removes carbon dioxide from the body. Detail: The respiratory system supplies oxygen to the blood and removes carbon dioxide, a waste product of metabolism, from the body. It includes the nasal passages, pharynx, larynx, trachea, bronchi, and lungs. The process begins with inhalation, where air enters through the nose or mouth, traveling down the trachea and into the bronchi, which branch into smaller bronchioles within the lungs. These end in alveoli, small air sacs where gas exchange occurs. Oxygen from inhaled air diffuses into the bloodstream, while carbon dioxide diffuses out to be exhaled. The diaphragm, a muscle under the lungs, contracts during inhalation and relaxes during exhalation, facilitating airflow. This system works closely with the circulatory system to ensure that all cells receive the oxygen they need for energy production.", "videoLink": "https://www.youtube.com/watch?v=67Jbbu7UZAA", "imageLink": "https://www.visiblebody.com/hs-fs/hub/189659/file-2545156127-jpg/Learn_Articles/Respiratory_System/Set_1_Five_Functions_of_Respiratory_Sys/1C-Respiratory-System.jpg", "referenceLink": "https://en.wikipedia.org/wiki/Respiratory_system", "keywords": "Topic Two,Topic 2,Respiratory"}, {"topicTitle": ["Topic 3", "Topic Three", "Digestive System"], "contextText": "Organs: Mouth, esophagus, stomach, intestines, liver, pancreas, gallbladder .Function: Breaks down food into nutrients for energy, growth, and cell repair; eliminates waste. Detail: The digestive system breaks down food into nutrients that the body can absorb and use for energy, growth, and cell repair. It includes organs such as the mouth, esophagus, stomach, intestines, liver, pancreas, and gallbladder. Digestion starts in the mouth, where enzymes in saliva begin breaking down carbohydrates. The food then moves down the esophagus to the stomach, where acids and enzymes further digest it. The partially digested food passes into the small intestine, where most nutrient absorption occurs, aided by enzymes from the pancreas and bile from the liver. The large intestine absorbs water and forms waste, which is excreted through the rectum. The digestive system also plays a role in immune defense, particularly through the gut microbiome, which helps protect against pathogens.", "videoLink": "https://www.youtube.com/watch?v=_T_vmcLyTzI", "imageLink": "https://online-learning-college.com/wp-content/uploads/2022/05/digestive-system-2048x1317.jpeg", "referenceLink": "https://en.wikipedia.org/wiki/Human_digestive_system", "keywords": "Topic Three,Topic 3,Digestive"}, {"topicTitle": ["Topic 4", "Topic Four", "Nervous System"], "contextText": "Organs: Brain, spinal cord, nerves, sensory organs .Function: Controls body activities by sending signals to and from different body parts; processes sensory information. Detail: The nervous system is the body’s control center, responsible for sending, receiving, and interpreting signals from all parts of the body. It includes the brain, spinal cord, and peripheral nerves. The central nervous system (CNS), composed of the brain and spinal cord, processes information and coordinates responses. The peripheral nervous system (PNS) connects the CNS to limbs and organs, allowing for communication between the brain and the rest of the body. Sensory neurons collect information from the environment, which is processed by the brain, while motor neurons control muscle actions. The autonomic nervous system, a part of the PNS, regulates involuntary activities like heartbeat and digestion. This system enables thinking, perception, voluntary movement, and coordination, impacting nearly every other system.", "videoLink": "https://www.youtube.com/watch?v=VAEmxt78bBI", "imageLink": "https://bhoperehab.com/wp-content/uploads/2024/02/drugs-nervous-system-scaled.jpeg", "referenceLink": "https://en.wikipedia.org/wiki/Nervous_system", "keywords": "Topic Four,Topic 4,Nervous"}, {"topicTitle": ["Topic 5", "Topic Five", "Muscular System"], "contextText": "Organs: Skeletal muscles, smooth muscles, cardiac muscles .Function: Enables movement, maintains posture, and produces heat. Detail: The muscular system enables movement, maintains posture, and produces body heat. It consists of three types of muscles: skeletal, smooth, and cardiac. Skeletal muscles, attached to bones, control voluntary movements like walking and lifting. Smooth muscles, found in organs like the intestines and blood vessels, control involuntary movements like digestion and blood flow. Cardiac muscle, found only in the heart, contracts to pump blood throughout the body. Muscles work by contracting and relaxing, often in pairs, and require signals from the nervous system to initiate action. This system is essential for physical movement, but it also plays roles in organ function and circulation.", "videoLink": "https://www.youtube.com/watch?v=rMcg9YzNSEs", "imageLink": "https://image.slidesharecdn.com/muscularsystem-220930072848-e9f2fcba/75/Muscular-System-ppt-1-2048.jpg", "referenceLink": "https://en.wikipedia.org/wiki/Muscular_system", "keywords": "Topic Five,Topic 5,Muscular"}, {"topicTitle": ["Topic 6", "Topic Six", "Skeletal System"], "contextText": "Organs: Bones, joints, cartilage, ligaments .Function: Supports and protects organs, enables movement, produces blood cells, and stores minerals. Detail: The skeletal system provides the body’s structural framework, protects vital organs, and works with the muscular system to facilitate movement. It includes bones, joints, cartilage, and ligaments. Bones serve several functions: they store minerals (e.g., calcium and phosphorus), produce blood cells in the bone marrow, and offer attachment points for muscles. The axial skeleton (skull, vertebral column, and rib cage) supports and protects the central nervous system and organs. The appendicular skeleton (limbs and pelvis) allows for mobility. Cartilage cushions joints, and ligaments connect bones, stabilizing and supporting movement.", "videoLink": "https://www.youtube.com/watch?v=38MsEkhdECM", "imageLink": "https://cdn.britannica.com/51/54751-050-E65F3C33/Front-views-human-skeleton.jpg", "referenceLink": "https://en.wikipedia.org/wiki/Human_skeleton", "keywords": "Topic Six,Topic 6,Skeletal"}, {"topicTitle": ["Topic 7", "Topic Seven", "Endocrine System"], "contextText": "Organs: Glands such as the pituitary, thyroid, adrenal glands, pancreas .Function: Produces hormones that regulate metabolism, growth, reproduction, and other functions. Detail: The endocrine system regulates bodily functions through hormones released by glands, such as the pituitary, thyroid, adrenal glands, and pancreas. Hormones are chemical messengers that travel through the bloodstream to target organs, affecting processes like metabolism, growth, development, mood, and reproduction. For example, insulin from the pancreas regulates blood sugar levels, while adrenaline from the adrenal glands prepares the body for stress. The pituitary gland, often called the “master gland,” controls other glands, playing a central role in growth, sexual development, and metabolism. This system’s balance is crucial for homeostasis and overall health.", "videoLink": "https://www.youtube.com/watch?v=ySkk7U_4PeY", "imageLink": "https://cdn.britannica.com/12/93312-004-6B1E3651/glands-female-human-endocrine-systems.jpg", "referenceLink": "https://en.wikipedia.org/wiki/Endocrine_system", "keywords": "Topic Seven,Topic 7,Endocrine"}, {"topicTitle": ["Topic 8", "Topic Eight", "Lymphatic (Immune) System"], "contextText": "Organs: Lymph nodes, lymphatic vessels, spleen, thymus, white blood cells .Function: Protects the body against infection and disease; returns fluid to the bloodstream. Detail: The lymphatic system is part of the immune system, defending the body against infections and disease. It consists of lymph nodes, lymph vessels, the spleen, thymus, and tonsils. Lymph, a fluid containing white blood cells, circulates through lymph vessels and filters through lymph nodes, trapping pathogens. The spleen helps fight infection and recycles old red blood cells, while the thymus is involved in T-cell maturation (a type of white blood cell). This system maintains fluid balance by returning excess tissue fluid to the bloodstream and helps absorb fats from the digestive system.", "videoLink": "https://www.youtube.com/watch?v=o0-1OknbO3M", "imageLink": "https://cdn.slidesharecdn.com/ss_thumbnails/bsc-lymphaticsystem-240406170735-d22aaf44-thumbnail.jpg", "referenceLink": "https://en.wikipedia.org/wiki/Lymphatic_system", "keywords": "Topic Eight,Topic 8,Lymphatic,Immune"}, {"topicTitle": ["Topic 9", "Topic Nine", "Urinary System"], "contextText": "Organs: Kidneys, ureters, bladder, urethra .Function: Removes waste products from the blood, regulates water balance, and maintains electrolyte levels. Detail: The urinary system removes waste products from the body and maintains fluid and electrolyte balance. It includes the kidneys, ureters, bladder, and urethra. The kidneys filter blood to remove waste and excess substances, forming urine. This urine flows through the ureters to the bladder, where it is stored until excretion through the urethra. This system also regulates blood pressure and pH balance by adjusting the amount of water and electrolytes in the blood. It plays a critical role in homeostasis and maintaining the body's internal environment.", "videoLink": "https://www.youtube.com/watch?v=CkGqp5tr-Qk", "imageLink": "https://i.ytimg.com/vi/zYRMJR9K4jY/hq720.jpg", "referenceLink": "https://en.wikipedia.org/wiki/Urinary_system", "keywords": "Topic Nine,Topic 9,Urinary"}, {"topicTitle": ["Topic 10", "Topic Ten", "Integumentary System"], "contextText": "Organs: Skin, hair, nails, glands .Function: Protects the body, regulates temperature, and provides sensory information. Detail: The integumentary system includes the skin, hair, nails, and glands. The skin, the body’s largest organ, serves as a protective barrier against external threats like pathogens, physical injury, and UV radiation. It also regulates temperature through sweating and blood flow adjustments. The skin contains sensory receptors that allow for the sensation of touch, pain, and temperature. Hair and nails protect and support the skin, while glands in the skin produce sweat for temperature regulation and sebum to keep the skin moisturized. This system is vital for protection, temperature regulation, and sensory perception.", "videoLink": "https://www.youtube.com/watch?v=whO2ndoMnsQ", "imageLink": "https://mblexguide.com/wp-content/uploads/2019/10/Integumentary-system-3-e1571317762734.jpg", "referenceLink": "https://en.wikipedia.org/wiki/Integumentary_system", "keywords": "Topic Ten,Topic 10,Integumentary"}]}